docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE15-c_management.cattle.io.setting.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 15 complete and 0 interrupted iterations
list   [  50% ] 1 VUs  0d00h00m00.6s/24h0m0s  15/30 iters, 30 per VU

     ✓ listing management.cattle.io.setting from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 121       ✗ 0  
     data_received..................: 4.8 MB  3.0 MB/s
     data_sent......................: 22 kB   14 kB/s
     http_req_blocked...............: avg=5.67ms   min=231ns   med=270ns    max=339.19ms p(90)=351ns    p(95)=361ns   
     http_req_connecting............: avg=28.31µs  min=0s      med=0s       max=918.39µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=17.49ms  min=5.96ms  med=22.9ms   max=72.61ms  p(90)=26.71ms  p(95)=27.66ms 
       { expected_response:true }...: avg=17.49ms  min=5.96ms  med=22.9ms   max=72.61ms  p(90)=26.71ms  p(95)=27.66ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 61 
     http_req_receiving.............: avg=824.37µs min=60.76µs med=380.98µs max=5.97ms   p(90)=1.79ms   p(95)=2.09ms  
     http_req_sending...............: avg=187.42µs min=33.12µs med=42.66µs  max=2.98ms   p(90)=105.61µs p(95)=937.91µs
     http_req_tls_handshaking.......: avg=148.78µs min=0s      med=0s       max=5.86ms   p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.48ms  min=5.65ms  med=21.11ms  max=72.32ms  p(90)=23.76ms  p(95)=26.51ms 
     http_reqs......................: 61      37.582346/s
     iteration_duration.............: avg=52.31ms  min=35.4ms  med=37.71ms  max=412.12ms p(90)=49.44ms  p(95)=57.37ms 
     iterations.....................: 30      18.483121/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m01.6s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m01.2s/24h0m0s  30/30 iters, 30 per VU