docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE16-a_management.cattle.io.clusters.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h00m00.9s/24h0m0s  23/30 iters, 30 per VU

     ✓ listing management.cattle.io.clusters from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 61        ✗ 0  
     data_received..................: 4.3 MB  3.3 MB/s
     data_sent......................: 15 kB   12 kB/s
     http_req_blocked...............: avg=294.73µs min=250ns   med=271ns   max=5.09ms   p(90)=431ns    p(95)=2.01ms  
     http_req_connecting............: avg=55.43µs  min=0s      med=0s      max=868.87µs p(90)=0s       p(95)=424.87µs
     http_req_duration..............: avg=34.75ms  min=29.85ms med=32.76ms max=73.21ms  p(90)=40.24ms  p(95)=43.46ms 
       { expected_response:true }...: avg=34.75ms  min=29.85ms med=32.76ms max=73.21ms  p(90)=40.24ms  p(95)=43.46ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 31 
     http_req_receiving.............: avg=1.33ms   min=66.23µs med=1.4ms   max=3.01ms   p(90)=1.86ms   p(95)=2.54ms  
     http_req_sending...............: avg=317.08µs min=31.58µs med=39.06µs max=3.6ms    p(90)=628.67µs p(95)=1.95ms  
     http_req_tls_handshaking.......: avg=205.3µs  min=0s      med=0s      max=3.28ms   p(90)=0s       p(95)=1.53ms  
     http_req_waiting...............: avg=33.1ms   min=28.4ms  med=30.97ms max=72.92ms  p(90)=39.95ms  p(95)=42.37ms 
     http_reqs......................: 31      24.025851/s
     iteration_duration.............: avg=41.59ms  min=35.77ms med=39.24ms max=78.66ms  p(90)=48.46ms  p(95)=51.6ms  
     iterations.....................: 30      23.250823/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m01.3s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m01.2s/24h0m0s  30/30 iters, 30 per VU