docs/20231222 - RKE2 100 clusters 1vs3 nodes comparison/tests_raw_data/benchmark_RKE20-c_configmaps.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: ./steve_paginated_api_benchmark.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 24h0m30s max duration (incl. graceful stop):
           * list: 30 iterations for each of 1 VUs (maxDuration: 24h0m0s, exec: list, gracefulStop: 30s)


running (0d00h00m01.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
list   [   3% ] 1 VUs  0d00h00m00.9s/24h0m0s  01/30 iters, 30 per VU

running (0d00h00m02.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
list   [  13% ] 1 VUs  0d00h00m01.9s/24h0m0s  04/30 iters, 30 per VU

running (0d00h00m03.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
list   [  20% ] 1 VUs  0d00h00m02.9s/24h0m0s  06/30 iters, 30 per VU

running (0d00h00m04.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
list   [  27% ] 1 VUs  0d00h00m03.9s/24h0m0s  08/30 iters, 30 per VU

running (0d00h00m05.0s), 1/1 VUs, 10 complete and 0 interrupted iterations
list   [  33% ] 1 VUs  0d00h00m04.9s/24h0m0s  10/30 iters, 30 per VU

running (0d00h00m06.0s), 1/1 VUs, 12 complete and 0 interrupted iterations
list   [  40% ] 1 VUs  0d00h00m05.9s/24h0m0s  12/30 iters, 30 per VU

running (0d00h00m07.0s), 1/1 VUs, 14 complete and 0 interrupted iterations
list   [  47% ] 1 VUs  0d00h00m06.9s/24h0m0s  14/30 iters, 30 per VU

running (0d00h00m08.0s), 1/1 VUs, 17 complete and 0 interrupted iterations
list   [  57% ] 1 VUs  0d00h00m07.9s/24h0m0s  17/30 iters, 30 per VU

running (0d00h00m09.0s), 1/1 VUs, 19 complete and 0 interrupted iterations
list   [  63% ] 1 VUs  0d00h00m08.9s/24h0m0s  19/30 iters, 30 per VU

running (0d00h00m10.0s), 1/1 VUs, 21 complete and 0 interrupted iterations
list   [  70% ] 1 VUs  0d00h00m09.9s/24h0m0s  21/30 iters, 30 per VU

running (0d00h00m11.0s), 1/1 VUs, 23 complete and 0 interrupted iterations
list   [  77% ] 1 VUs  0d00h00m10.9s/24h0m0s  23/30 iters, 30 per VU

running (0d00h00m12.0s), 1/1 VUs, 25 complete and 0 interrupted iterations
list   [  83% ] 1 VUs  0d00h00m11.9s/24h0m0s  25/30 iters, 30 per VU

running (0d00h00m13.0s), 1/1 VUs, 27 complete and 0 interrupted iterations
list   [  90% ] 1 VUs  0d00h00m12.9s/24h0m0s  27/30 iters, 30 per VU

running (0d00h00m14.0s), 1/1 VUs, 29 complete and 0 interrupted iterations
list   [  97% ] 1 VUs  0d00h00m13.9s/24h0m0s  29/30 iters, 30 per VU

     ✓ listing configmaps from cluster local (k8s style pagination) succeeds
     ✓ no slow pagination errors (410 Gone) detected

     █ setup

       ✓ logging in returns status 200

   ✓ checks.........................: 100.00% ✓ 361       ✗ 0  
     data_received..................: 107 MB  7.6 MB/s
     data_sent......................: 286 kB  20 kB/s
     http_req_blocked...............: avg=79.12µs  min=240ns   med=270ns    max=5.86ms   p(90)=351ns    p(95)=440ns   
     http_req_connecting............: avg=12.44µs  min=0s      med=0s       max=761.75µs p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=67.54ms  min=16.65ms med=37.88ms  max=220.29ms p(90)=176.31ms p(95)=180.67ms
       { expected_response:true }...: avg=67.54ms  min=16.65ms med=37.88ms  max=220.29ms p(90)=176.31ms p(95)=180.67ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 181
     http_req_receiving.............: avg=4.4ms    min=65.1µs  med=1.5ms    max=26.67ms  p(90)=17.05ms  p(95)=18.8ms  
     http_req_sending...............: avg=216.66µs min=33.26µs med=48.67µs  max=4.27ms   p(90)=96.72µs  p(95)=1.34ms  
     http_req_tls_handshaking.......: avg=61.28µs  min=0s      med=0s       max=5ms      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=62.92ms  min=15.03ms med=35.06ms  max=198.86ms p(90)=157.84ms p(95)=162.37ms
     http_reqs......................: 181     12.878608/s
     iteration_duration.............: avg=453.33ms min=77.84ms med=459.49ms max=525.57ms p(90)=497.09ms p(95)=505.13ms
     iterations.....................: 30      2.134576/s
     vus............................: 1       min=1       max=1
     vus_max........................: 1       min=1       max=1


running (0d00h00m14.1s), 0/1 VUs, 30 complete and 0 interrupted iterations
list ✓ [ 100% ] 1 VUs  0d00h00m14.0s/24h0m0s  30/30 iters, 30 per VU